{
  "name":"убедительность",
  "power":0,
  "agility":0,
  "eloquence":5,
  "loc":{
    "1":{
      "text":"Богатые Плутократы - это богатые и могущественные существа, контролирующие богатую планету Плутократия. Основной ресурс - драгоценные металлы и камни, используемые для создания ювелирных изделий и денег. Их жадность делает их уязвимыми для краж и покупок. Слабость: Незаметно украсть, Купить.",
      "isVisited":true,
      "distances":{
        "2":3,
        "3":3,
        "4":6,
        "5":6,
        "6":9,
        "7":9,
        "8":12,
        "9":15,
        "10":6,
        "11":16
      },
      "species":"богатые плутократы",
      "planet":"плутократия",
      "resource":"драгоценные металлы и камни",
      "planetNumber":1,
      "fuelCost":1
    },
    "2":{
      "text":"Мирные Зеффиры - это существа, живущие в гармонии с природой на планете Зефир-9 с сильными ветрами. Основной ресурс - энергия ветра, используемая для выработки электроэнергии. Их неспособность защитить свои ресурсы от силового захвата делает их уязвимыми для отобрать силой. Слабость: Отобрать силой.",
      "isVisited":"false",
      "distances":{
        "1":3,
        "3":6,
        "4":3,
        "5":9,
        "6":6,
        "7":12,
        "8":9,
        "9":12,
        "10":6,
        "11":16
      },
      "species":"мирные зеффиры",
      "planet":"зефир-9",
      "resource":"энергия ветра",
      "fuelCost":2
    },
    "3":{
      "text":"Знатоки Прометея - это высокоразвитые существа, населяющие планету Прометей. Основной ресурс Прометея - это технологии и инновации. Эти существа обладают невероятной способностью к изобретениям и созданию передовых технологий. Планета Прометей покрыта футуристическими городами и лабораториями, где Знатоки неустанно работают над созданием новых изобретений. Они постоянно стремятся к совершенству и не останавливаются перед ничтожными препятствиями. Однако, их поглощенность работой и изобретениями делает их уязвимыми для внешних атак. Они не имеют сильной армии или защитных систем. Слабость: Отобрать силой, незаметно украсть.",
      "isVisited":"false",
      "distances":{
        "1":3,
        "2":6,
        "4":9,
        "5":3,
        "6":12,
        "7":6,
        "8":9,
        "9":12,
        "10":6,
        "11":16
      },
      "species":"знатоки прометея",
      "planet":"прометей",
      "resource":"технологии и инновации",
      "fuelCost":3
    },
    "4":{
      "text":"Бронированные Титаны - это мощные существа, обитающие на планете-гиганте **Титан-7**, покрытой мощной броней. Основной ресурс - металлы и минералы, используемые для производства оружия и брони. Их жадность и склонность к роскоши делает их уязвимыми для покупки. Слабость: Купить.",
      "isVisited":"false",
      "distances":{
        "1":6,
        "2":3,
        "3":9,
        "5":12,
        "6":3,
        "7":9,
        "8":6,
        "9":9,
        "10":9,
        "11":19
      },
      "species":"бронированные титаны",
      "planet":"титан-7",
      "resource":"металлы и минералы",
      "fuelCost":1
    },
    "5":{
      "text":"Хитроумные Трикстеры - это умные и коварные существа, населяющие планету-лабиринт Триксис. Основной ресурс - редкие кристаллы, используемые для создания передовых технологий. Их ресурсы можно легко украсть, если вы хитрее их. Слабость: Незаметно украсть.",
      "isVisited":"false",
      "distances":{
        "1":6,
        "2":9,
        "3":3,
        "4":12,
        "6":9,
        "7":3,
        "8":6,
        "9":9,
        "10":9,
        "11":19
      },
      "species":"хитроумные трикстеры",
      "planet":"триксис",
      "resource":"редкие кристаллы",
      "fuelCost":2
    },
    "6":{
      "text":"Землекопы Гномы - это трудолюбивые существа, живущие на подземной планете Гномония. Основной ресурс - драгоценные металлы и камни, добываемые в подземных шахтах. Их ресурсы легко можно купить, но их подземные туннели делают их уязвимыми для краж. Слабость: Незаметно украсть, Купить.",
      "isVisited":"false",
      "distances":{
        "1":9,
        "2":6,
        "3":12,
        "4":3,
        "5":9,
        "7":6,
        "8":3,
        "9":6,
        "10":12,
        "11":16
      },
      "species":"землекопы гномы",
      "planet":"гномония",
      "resource":"драгоценные металлы и камни",
      "fuelCost":1
    },
    "7":{
      "text":"Призрачные Спектры - это эфирные существа, живущие планете **Туманность**, полной газов и пыли. Основной ресурс - редкий газ, используемые для межзвездных путешествий. Их неспособность физически защищать свои ресурсы делает их уязвимыми для краж. Слабость: Незаметно украсть.",
      "isVisited":"false",
      "distances":{
        "1":9,
        "2":12,
        "3":6,
        "4":9,
        "5":3,
        "6":6,
        "8":3,
        "9":6,
        "10":12,
        "11":16
      },
      "species":"призрачные спектры",
      "planet":"туманность",
      "resource":"редкий газ",
      "fuelCost":2
    },
    "8":{
      "text":"Воинственные Берсеркеры - это агрессивные существа, населяющие планету-вулкан Берсерк. Основной ресурс - огонь и лава, используемые для производства оружия и энергии. Их агрессивность и неспособность контролировать свои эмоции делает их уязвимыми для обмана и краж. Слабость: Незаметно украсть, Отобрать силой.",
      "isVisited":"false",
      "distances":{
        "1":12,
        "2":9,
        "3":9,
        "4":6,
        "5":6,
        "6":3,
        "7":3,
        "9":6,
        "10":15,
        "11":16
      },
      "species":"воинственные берсеркеры",
      "planet":"берсерк",
      "resource":"огонь и лава",
      "fuelCost":3
    },
    "9":{
      "text":"Золотой Рай - это необитаемая планета, покрытая золотыми песками. Основной ресурс - золото, которое может быть использовано для создания ювелирных изделий и денег.",
      "isVisited":"false",
      "distances":{
        "1":15,
        "2":12,
        "3":12,
        "4":9,
        "5":9,
        "6":6,
        "7":6,
        "8":6,
        "10":18,
        "11":10
      },
      "species":"-",
      "planet":"золотой рай",
      "resource":"золото"
    },
    "10":{
      "text":"Ледяная Твердыня - это необитаемая планета, покрытая льдом и снегом. Основной ресурс - вода, которая может быть использована для выращивания растений и поддержания жизни.",
      "isVisited":"false",
      "distances":{
        "1":6,
        "2":6,
        "3":6,
        "4":9,
        "5":9,
        "6":12,
        "7":12,
        "8":15,
        "9":18,
        "11":10
      },
      "species":"-",
      "planet":"ледяная твердыня",
      "resource":"вода"
    },
    "11":{
      "text":"После многих лет путешествий, мы, наконец, достигли планеты Сапиенция, населенной мудрыми и всезнающими существами. Эта планета, покрытая огромными библиотеками, является источником мудрости и знаний во всей галактике. Жители Сапиенции, известные как Сапиенты, обладают невероятной способностью к обучению и пониманию всего вокруг них. Основной ресурс Сапиенции - это знания и информация, хранящиеся в библиотеках. Мы рады, что наконец-то достигли этой планеты, и не можем дождаться, чтобы начать наше обучение с Сапиентами. Это действительно чудесное место, и мы знаем, что мы вернемся домой с несметным количеством знаний и мудрости.",
      "isVisited":"false",
      "distances":{
        "1":16,
        "2":16,
        "3":16,
        "4":19,
        "5":19,
        "6":16,
        "7":16,
        "8":16,
        "9":10,
        "10":10
      },
      "species":"сапиенты",
      "planet":"cапиенция",
      "resource":""
    }
  },
  "gold":0,
  "fuel":3,
  "birthPlace":{
    "text":"Богатые Плутократы - это богатые и могущественные существа, контролирующие богатую планету Плутократия. Основной ресурс - драгоценные металлы и камни, используемые для создания ювелирных изделий и денег. Их жадность делает их уязвимыми для краж и покупок. Слабость: Незаметно украсть, Купить.",
    "isVisited":true,
    "distances":{
      "2":3,
      "3":3,
      "4":6,
      "5":6,
      "6":9,
      "7":9,
      "8":12,
      "9":15,
      "10":6,
      "11":16
    },
    "species":"богатые плутократы",
    "planet":"плутократия",
    "resource":"драгоценные металлы и камни",
    "planetNumber":1,
    "fuelCost":1
  },
  "currentPlanetNumber":1
}